# 代码随想录算法训练 Day 2 | 数组总结

Completed: December 8, 2022

Topic: Array

- [x] Done

- [ ] Redo


## 总结

### ****二分法****

1. 二分的使用前提：有序数组并且无重复元素。
2. 分清左闭右闭和左闭右开的不同情况。
- 左闭右闭

> right = nums.length - 1
while (left <= right) 
	    right = mid - 1; 
            left = mid + 1;
> 
- 左闭右开

> right = nums.length;
while (left < right) 
	    right = mid; 
      left = mid + 1;
> 

### ****双指针法****

通过一个快指针和慢指针在一个for循环下完成两个for循环的工作。

### ****滑动窗口****

原理和双指针一样。两个指针都能固定住，并且一个指针固定，另一个指针不断移动，从而得出我们要想的结果。

### ****螺旋矩阵****

旋转时，保持每一边一样的处理规则，比如左闭右开，或者左开右闭。

对于正方形的二维教组只需要考虑转多少圈以及n为基数时中间剩一个值，如果剩一个一个值需要再转完圈后再单独加中间的值。
